package net.paiyou.dto;

public interface StatusCode {
    //"1": "操作异常",
    short OPERTATION_ERROR = 1;
    //"2": "密码不正确",
    short PWD_ERROR = 2;
    //"3": "账号已存在",
    short USER_EXSIT = 3;
    // "4": "角色名字存在",
    short ACTOR_NAME_EXSIT = 4;
    //"5": "账号不存在",
    short ACCOUNT_NOT_EXSIT = 5;
    //"6": "角色名字不存在",
    short ACTOR_NAME_NOT_EXSIT = 6;
    //"7": "支付失败",
    short PAY_FAIL = 7;
    //	"8": "金豆不足",
    short BALANCE_NOT_ENOUGH = 8;
    //	"9": "客户端数据错误",
//	"10": "找不到OPENID",
    short NOT_FIND_OPENID = 10;
    //	"11": "找不到指定奖励",
//	"12": "奖励已经领取",
//	"13": "奖励自动发放",
//	"14": "奖励非本人所有",
//	"15": "娃娃配置信息为空",
//	"16": "已经是最大页数了",
//	"17": "服务器已经爆满了，请稍后再试",
//	"18": "代理人不存在",
//	"19": "渠道不存在",
//	"20": "您还未投入",
//	"21": "竞猜题目已经开奖或关闭！",
//	"22": "已经竞猜了",
//	"23": "不能使用橡皮擦",
//	"24": "每日一猜今天暂停。",
//	"25": "橡皮擦使用达到上限",
//	"26": "免费次数用尽",
//	"27": "库存空啦！",
    short STOCK_EMPTY = 27;
    //	"28": "您还未填写地址",
//	"29": "手机已经被绑定了",
    short BANK_NOT_BINDED = 29;
//	"30": "手机号码不存在",
//	"31": "请1分钟后再试。",
//	"32": "您已续投过了。",
//	"33": "您还没有续投记录",
//	"34": "该题目已开奖或关闭！",
//	"35": "竞猜正在进行，请勿删除，您可以选择关闭竞猜！",
//	"36": "验证码不对",
    short PHONE_CODE_ERROR = 36;
    //	"37": "当前帐号已被绑定过手机",
    short PHONE_BINDED = 37;
    //	"38": "当前帐号已被绑定过银行卡",
    short BANK_BINDED = 38;
//	"39": "系统繁忙，请稍后再试！",
//	"40": "投注已截止！",
//	"41": "娃娃奖品已更改",
//	"42": "盈利榜已发过奖！",
//	"43": "已经发奖，不能改状态",
//	"44": "您还未绑定手机！",
    short PHONE_NOT_BINDED = 44;
//	"45": "停止下注",
    short END_STAKE = 45;
    //	"46": "提现失败",
    short WITHDRAW_FAIL = 46;
    //	"47": "提现金额不足",
    short WITHDRAW_GOLD_NOT_ENOUGH = 47;
    //	"49": "兑换次数达到上限",
    //	"48": "服务器正在维护",
//	"47": "动物被抓走啦！",

    short EXCHANGE_MAX = 49;
    //	"50": "碎片不足",
//	"51": "你被禁言",
//	"52": "押注达到上限",
    short STAKE_MAX = 52;
    //	"53": "您被封号了！",
//	"54": "魅力值不足",
//	"2001": "房间不存在",
    short ROOM_NOT_EXSIT = 2001;
//	"2002": "开奖中",
//	"2003": "玩家不在当前房间",
//	"4001": "任务尚未完成",
//	"4002": "您的分享次数达到上限啦！",
//	"4003": "不要频繁分享哦，这样会打扰到朋友的！",
//	"4004": "今天宝箱金币已经达到上限",
    short CODE_EXPIRED = 7001;
    short CODE_MISMATCHING = 7002;
//	"7001": "验证码已失效！",
//	"7002": "验证码不匹配！"
	//"7003":房间满了
	short ROOM_FULL = 7003;

}
